# LEET CODE
## Problem-2881: Create a New Column
Class: Easy

Source: https://leetcode.com/problems/create-a-new-column/

## Description
DataFrame employees

| Column Name | Type.  |
|-------------|--------|
| name        | object |
| salary      | int.   |

A company plans to provide its employees with a bonus.

## To Do
Write a solution to create a new column name bonus that contains the doubled values of the salary column.

The result format is in the following example.

## Example

Input:

DataFrame employees
| name    | salary |
|---------|--------|
| Piper   | 4548   |
| Grace   | 28150  |
| Georgia | 1103   |
| Willow  | 6593   |
| Finn    | 74576  |
| Thomas  | 24433  |

Output:
| name    | salary | bonus  |
|---------|--------|--------|
| Piper   | 4548   | 9096   |
| Grace   | 28150  | 56300  |
| Georgia | 1103   | 2206   |
| Willow  |  593   | 13186  |
| Finn    | 74576  | 149152 |
| Thomas  | 24433  | 48866  |

Explanation: 
- A new column bonus is created by doubling the value in the column salary.

## Importing

In [1]:
import pandas as pd
from typing import List

## Task

In [2]:
def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    df = employees.copy()
    df['bonus'] = df.salary * 2
    return df

In [3]:
data = {
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
}

df = pd.DataFrame(data)

createBonusColumn(df)

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866